Revit 2027 API
Application.IsElectricalEnabled Property
 Checks whether or not the electrical discipline is enabled, and enable or disable it.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsElectricalEnabled { get; set; }
Public Property IsElectricalEnabled As Boolean
	Get
	Set
public:
property bool IsElectricalEnabled {
	bool get ();
	void set (bool value);
}
member IsElectricalEnabled : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace